# <1>两数求和-7/24/25---------------------------------------------------------
num1 = 12
num2 = 13
result = num1 + num2
print(result)

# <2>求100内偶数--------------------------------------------------------------
list = []
for i in range(0,100):                  # 0到99包头不包尾
    if i % 2 == 0:                      # 忘记了余数是%
        list.append(i)                  # 不知道使用列表添加元素
print(list)

# <3>求100内奇数--------------------------------------------------------------
list = []
for i in range(1,100,2):                # 也可以用上边的方法
    list.append(i)
print(list)