# <6>给半径求圆的周长----------------------------------------------------------
pi = 3.14                               # 也可以import math用math.pi
r = float(input("请输入半径："))
c = 2 * pi * r
print(f"圆的周长是：{c}")                # f字符串

# <7>给半径求圆的面积----------------------------------------------------------
import math
s = math.pow(r,2) * math.pi
print(f"圆的面积是：{s}")

# <8>求直角三角形斜边----------------------------------------------------------
import math
a = int(input("请输入第一个直角边长："))
b = int(input("请输入第二个直角边长："))
c = math.sqrt(math.pow(a,2) + math.pow(b,2))
print(f"斜边长度为{c}")