# <53>判断快乐数---------------------------------------------------------------------
# 示例：19-->1*1 + 9*9 = 82-->8*8 + 2*2 = 68--->6*6 + 8*8 = 100--->1,最后是1为快乐数
def change(x):        # 定义求和函数，输出为岔开求和结果，多次调用此函数达到题中目的
    sum = 0
    while x > 0:
        j = x % 10    # 个位
        sum += j * j
        x //= 10      # 因为不清楚几位数，所以后往前依次取个位，最后商为0时退出循环
    return sum        # 返回求和后二级数

def is_fun(n):
    while n > 9:      # 确保非一位数时继续循环
        n = change(n) # 不剩一位数时继续转换
    if n == 1:        # 最后为一位数时判断是否为1
        return True
    else:
        return False

print(is_fun(int(input("输入正整数:\n"))))

# 多定义函数分层结构提高代码可读性